ERP.belugaerp/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>бг_АнализыДляУдостоверенияОКачестве</name>
    <type>
      <types>CatalogRef.бг_ТиповыеАнализыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Вариативность</name>
    <type>
      <types>CatalogRef.бг_ВариативностьНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Выбыл</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Добавлен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕК_СУМ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СУМ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНоменклатурыSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КонтрагентПроизводитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НормативныйДокумент</name>
    <type>
      <types>CatalogRef.бг_НормативныеДокументыСертификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбменB2B</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОписаниеСоставаПродукта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновноеНаименование</name>
    <type>
      <types>CatalogRef.бг_ОсновныеНаименованияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Предшественник</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокГодности</name>
    <type>
      <types>CatalogRef.бг_ЕК_Номенклатура_СрокГодности</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокХраненияПробВЛабораторииМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаПроизводителя</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипИмпортныхССП</name>
    <type>
      <types>EnumRef.бг_ТипыИмпортныхССП</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипМарки</name>
    <type>
      <types>CatalogRef.бг_КлассификаторТиповМарок</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УсловияТранспортирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ФайлПиктограммы</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>бг_СпособыОбеспеченияПотребности</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбеспеченияПотребностей</name>
      <type>
        <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Enums/бг_ТипыЕдиницИзмерения/бг_ТипыЕдиницИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ТипыЕдиницИзмерения</name>
  <enumValues>
    <name>Бутылка</name>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
  </enumValues>
  <enumValues>
    <name>Паллета</name>
  </enumValues>
  <enumValues>
    <name>Дал</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/бг_Штрихкоды_ЕК_Номенклатуры/бг_Штрихкоды_ЕК_Номенклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_Штрихкоды_ЕК_Номенклатуры</name>
  <owners>Catalog.УпаковкиЕдиницыИзмерения</owners>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/Номенклатура/Forms/НастройкиПараметровКопированияДополнительныхДанных/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ЭлементДляУдаления 
		= ПараметрыКопированияДополнительныхДанных.НайтиПоЗначению("КопироватьИндивидуальныеУпаковки"); 
		
	Если Не ЭлементДляУдаления = Неопределено Тогда 
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникКопирования, 
			"ВидНоменклатуры.бг_ОграничиватьДобавлениеИзменениеНоменклатуры") = Истина Тогда
    		ПараметрыКопированияДополнительныхДанных.Удалить(ЭлементДляУдаления); 
			бг_ЗаполнитьУпаковкиИШтрихкоды();
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы 

&НаКлиенте
Процедура бг_ПараметрыКопированияДополнительныхДанныхПометкаПриИзмененииПосле(Элемент)

	ТекущийЭлементСписка = Элементы.ПараметрыКопированияДополнительныхДанных.ТекущиеДанные;
	Если Не ТекущийЭлементСписка = Неопределено 
		И ТипЗнч(ТекущийЭлементСписка.Значение) = Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения") Тогда 
		
		УпаковкаКоробка = ЭтаФорма.бг_СоответствиеПаллетыКоробке.Получить(ТекущийЭлементСписка.Значение);
		ПодчиненныеШтрихкоды = ЭтаФорма.бг_ПодчиненныеШтрихкоды.Получить(УпаковкаКоробка);
		
		Если ПодчиненныеШтрихкоды = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для каждого ЭлементДанных Из ПараметрыКопированияДополнительныхДанных Цикл
			
			Если ПодчиненныеШтрихкоды.Найти(ЭлементДанных.Значение) <> Неопределено Тогда
				ЭлементДанных.Пометка = ТекущийЭлементСписка.Пометка;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ЗаполнитьУпаковкиИШтрихкоды() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕдиницаКоробка.Ссылка КАК ЕдиницаИзмеренияКоробка,
	|	ЕСТЬNULL(УпаковкаПаллета.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмеренияПаллета
	|ПОМЕСТИТЬ втКоробки
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК ЕдиницаКоробка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкаПаллета
	|		ПО ЕдиницаКоробка.Ссылка = УпаковкаПаллета.Родитель
	|			И (УпаковкаПаллета.ЕдиницаИзмерения.бг_ТипЕдиницыИзмерения = &ТипПаллета)
	|ГДЕ
	|	ЕдиницаКоробка.Владелец = &ИсточникКопирования
	|	И ЕдиницаКоробка.ЕдиницаИзмерения.бг_ТипЕдиницыИзмерения = &ТипКоробка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втКоробки.ЕдиницаИзмеренияКоробка КАК ЕдиницаИзмеренияКоробка,
	|	втКоробки.ЕдиницаИзмеренияПаллета КАК ЕдиницаИзмеренияПаллета,
	|	втКоробки.ЕдиницаИзмеренияКоробка.Наименование КАК КоробкаНаименование,
	|	втКоробки.ЕдиницаИзмеренияПаллета.Наименование КАК ПаллетаНаименование
	|ИЗ
	|	втКоробки КАК втКоробки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бг_Штрихкоды_ЕК_Номенклатуры.Штрихкод КАК Штрихкод,
	|	бг_Штрихкоды_ЕК_Номенклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	бг_Штрихкоды_ЕК_Номенклатуры.Ссылка КАК Ссылка,
	|	втКоробки.ЕдиницаИзмеренияКоробка КАК ЕдиницаИзмеренияКоробка
	|ИЗ
	|	втКоробки КАК втКоробки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бг_Штрихкоды_ЕК_Номенклатуры КАК бг_Штрихкоды_ЕК_Номенклатуры
	|		ПО втКоробки.ЕдиницаИзмеренияКоробка = бг_Штрихкоды_ЕК_Номенклатуры.Владелец";

	Запрос.УстановитьПараметр("ИсточникКопирования", ИсточникКопирования);
	Запрос.УстановитьПараметр("ТипКоробка", Перечисления.бг_ТипыЕдиницИзмерения.Коробка);
	Запрос.УстановитьПараметр("ТипПаллета", Перечисления.бг_ТипыЕдиницИзмерения.Паллета);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаУпаковки = РезультатЗапроса[1].Выгрузить();
	ТаблицаШтрихкоды = РезультатЗапроса[2].Выгрузить();
	
	СоответствиеПаллетыКоробке = Новый Соответствие;
	Для каждого СтрокаТЧ Из ТаблицаУпаковки Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЧ.ЕдиницаИзмеренияПаллета) Тогда
			ПараметрыКопированияДополнительныхДанных.Добавить(
				СтрокаТЧ.ЕдиницаИзмеренияПаллета,
				СтрШаблон(НСтр("ru='%1 / %2'"), СтрокаТЧ.КоробкаНаименование, СтрокаТЧ.ПаллетаНаименование),
				Ложь);  
			СоответствиеПаллетыКоробке.Вставить(СтрокаТЧ.ЕдиницаИзмеренияПаллета, СтрокаТЧ.ЕдиницаИзмеренияКоробка);
		Иначе
			ПараметрыКопированияДополнительныхДанных.Добавить(
				СтрокаТЧ.ЕдиницаИзмеренияКоробка,
				СтрШаблон(НСтр("ru='%1'"), СтрокаТЧ.КоробкаНаименование),
				Ложь); 
			СоответствиеПаллетыКоробке.Вставить(СтрокаТЧ.ЕдиницаИзмеренияКоробка, СтрокаТЧ.ЕдиницаИзмеренияКоробка);
		КонецЕсли;
		
	КонецЦикла; 
	
	ПодчиненныеШтрихкоды = Новый Соответствие;
	Для каждого СтрокаТЧ Из ТаблицаШтрихкоды Цикл
		
		ПараметрыКопированияДополнительныхДанных.Добавить(
			СтрокаТЧ.Ссылка,
			СтрШаблон(НСтр("ru='Штрихкод: %1 (ед. изм. %2) к коробке %3'"), 
				СтрокаТЧ.Штрихкод, 
				СтрокаТЧ.ЕдиницаИзмерения,
				СтрокаТЧ.ЕдиницаИзмеренияКоробка),
			Ложь);
			
		МассивПодчиненныеШтрихкоды = ПодчиненныеШтрихкоды.Получить(СтрокаТЧ.ЕдиницаИзмеренияКоробка);
		Если МассивПодчиненныеШтрихкоды = Неопределено Тогда
			МассивПодчиненныеШтрихкоды = Новый Массив;
		КонецЕсли;
		МассивПодчиненныеШтрихкоды.Добавить(СтрокаТЧ.Ссылка);
		
		ПодчиненныеШтрихкоды.Вставить(СтрокаТЧ.ЕдиницаИзмеренияКоробка, МассивПодчиненныеШтрихкоды);
		
	КонецЦикла;
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("бг_ПодчиненныеШтрихкоды", Новый ОписаниеТипов()));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("бг_СоответствиеПаллетыКоробке", Новый ОписаниеТипов()));
	ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);
	
	ЭтаФорма.бг_ПодчиненныеШтрихкоды = Новый ФиксированноеСоответствие(ПодчиненныеШтрихкоды);
	ЭтаФорма.бг_СоответствиеПаллетыКоробке = Новый ФиксированноеСоответствие(СоответствиеПаллетыКоробке);
	
КонецПроцедуры

#КонецОбласти
